# Pandas - Missing Data

In [1]:
import numpy as np
import pandas as pd

In [6]:
# create Series from dictionary
# -- create DataFrame from dictionary

d = {'A':[1,2,np.nan],'B':[1,np.nan,np.nan],'C':[1,2,np.nan],'D':[1,2,3]}

In [7]:
df = pd.DataFrame(d)

In [8]:
df

     A    B    C  D
0  1.0  1.0  1.0  1
1  2.0  NaN  2.0  2
2  NaN  NaN  NaN  3

In [9]:
# drop missing data from row
df.dropna()

     A    B    C  D
0  1.0  1.0  1.0  1

In [10]:
# drop missing data from column
df.dropna(axis=1)

   D
0  1
1  2
2  3

In [11]:
df.dropna(thresh=2)

     A    B    C  D
0  1.0  1.0  1.0  1
1  2.0  NaN  2.0  2

In [12]:
df

     A    B    C  D
0  1.0  1.0  1.0  1
1  2.0  NaN  2.0  2
2  NaN  NaN  NaN  3

In [13]:
df.fillna(value=10)

      A     B     C  D
0   1.0   1.0   1.0  1
1   2.0  10.0   2.0  2
2  10.0  10.0  10.0  3

In [14]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [15]:
df.fillna(value=df.mean())

     A    B    C  D
0  1.0  1.0  1.0  1
1  2.0  1.0  2.0  2
2  1.5  1.0  1.5  3